In [1]:
# Load the Pandas libraries with alias 'pd' 
import pandas as pd 
# Read data from file 'filename.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 
data = pd.read_csv("testingData_7.csv") 
# Preview the first 5 lines of the loaded data 
data.head()

            Nombre  text_new
0   1rlz2mu5dkz..7         7
1  1gwoythppyk..14        14
2  0ice5uciuew..13        13
3   1iqxz4zfghj..2         2
4  0ab3zs3julz..17        17

In [2]:
data['text_new'] = data['Nombre'].str.split('.').str[2]
data['text_new'] = (',' + data['text_new'])
data.head()

            Nombre text_new
0   1rlz2mu5dkz..7       ,7
1  1gwoythppyk..14      ,14
2  0ice5uciuew..13      ,13
3   1iqxz4zfghj..2       ,2
4  0ab3zs3julz..17      ,17

In [3]:
data['Nombre'] = data['Nombre'].str.split('.').str[0]
data['Nombre'] = (data['Nombre'] + '..')

In [4]:
data.head()

          Nombre text_new
0  1rlz2mu5dkz..       ,7
1  1gwoythppyk..      ,14
2  0ice5uciuew..      ,13
3  1iqxz4zfghj..       ,2
4  0ab3zs3julz..      ,17

In [5]:
data.to_csv(r'testingData_2.csv', index=False)